#include <iostream>
#include <cmath>

int main()
{
    setlocale(LC_ALL, "Russian");
    
    // Задание 1
    //---------------------------------------------------------------------------------
    /* {
        int number = 0;
        int copy = 0;
        int i = 0;

        std::cout << "Введите значение переменной:\n";
        std::cin >> number;

        copy = number;

        while (copy) {
            ++i;
            copy /= 10;
        }
        i--;
        std::cout << "Значение ее разрядов:\n";
        for (i; i >= 0; --i) {

            std::cout << (int)(number / pow(10, i)) % 10 << ' ';
        }
    }*/
    //---------------------------------------------------------------------------------

    // Задание 2
    //---------------------------------------------------------------------------------
    /* {
        int number = 0;
        int copy = 0;
        int i = 0;

        std::cout << "Введите значение переменной:\n";
        std::cin >> number;

        copy = number;

        while (copy) {
            ++i;
            copy /= 10;
        }
        i--;
        std::cout << "Лесенка из значений ее разрядов:\n";
        for (i; i >= 0; --i) {

            std::cout << (int)(number / pow(10, i)) << std::endl;
        }
    }*/
    //---------------------------------------------------------------------------------
    
    // Задание 3
    //---------------------------------------------------------------------------------
    /* {
        int date = 0, serviceLife = 0;
        std::cout << "Введите дату изготовления клетки:\n";
        std::cin >> date;
        std::cout << "Введите срок службы клетки:\n";
        std::cin >> serviceLife;
        std::cout << "Клетка выйдет из эксплуатации в " << date + serviceLife << " году" << std::endl;
    }*/
    //---------------------------------------------------------------------------------

    // Задание 4
    //---------------------------------------------------------------------------------
    /* {
        int number = 0;
        std::cout << "Введите число\n";
        std::cin >> number;
        
        number > -12 ? number < 0 ? std::cout << "Входит в промежуток (-12, 0)\n" : 
                                    std::cout << "Не входит в промежуток (-12, 0)\n" : 
                                    std::cout << "Не входит в промежуток (-12, 0)\n";

        number == 1 ? std::cout << "Входит в промежуток {1}\n" :
                      std::cout << "Не входит в промежуток {1}\n";

        number >= 4 ? number <= 8 ? std::cout << "Входит в промежуток [4, 8]\n" :
                                    std::cout << "Не входит в промежуток [4, 8]\n" :
                                    std::cout << "Не входит в промежуток [4, 8]\n";

        number >= 12 ? number < 48 ? std::cout << "Входит в промежуток [12, 48)\n" :
                                    std::cout << "Не входит в промежуток [12, 48)\n" :
                                    std::cout << "Не входит в промежуток [12, 48)\n";
    }*/
    //---------------------------------------------------------------------------------

    // Задание 5
    //---------------------------------------------------------------------------------
    {
        float a, b;
        int number;

        std::cout << "Введите два числа\n";
        std::cin >> a >> b;

        std::cout << "Какую операцию хотите сделать?\n";
        std::cout << " 1 - Сложение\n";
        std::cout << " 2 - Вычитание\n";
        std::cout << " 3 - Умножение\n";
        std::cout << " 4 - Деление\n";
        std::cout << " 5 - Возведение в степень\n";
        std::cout << " 6 - Логарифм по основанию a числа b\n";
        std::cin >> number;

        switch (number) {
        case 1:
            std::cout << "Результат действия равен = " << a + b << std::endl;
            break;
        case 2:
            std::cout << "Результат действия равен = " << a - b << std::endl;
            break;
        case 3:
            std::cout << "Результат действия равен = " << a * b << std::endl;
            break;
        case 4:
            std::cout << "Результат действия равен = " << a / b << std::endl;
            break;
        case 5:
            pow(a,b) > 4000000 ? std::cout << "Число слишком большое" << std::endl : 
                                 std::cout << "Результат действия равен = " << pow(a, b) << std::endl;
           
            break;
        case 6:
            std::cout << "Результат действия равен = " << log(a) / log(b) << std::endl;
            break;
        }
    }
    //---------------------------------------------------------------------------------
}

